; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :typing :equality)
    (:types
        block - object
    )

    (:constants
        
    )

    (:predicates
        (on ?x1 - block ?x2 - block)
        (ontable ?x1 - block)
        (clear ?x1 - block)
        (handempty )
        (holding ?x1 - block)
    )

    (:functions
        
    )

    

    
    (:action pick-up
     :parameters (?x - block)
     :precondition (and (clear ?x) (ontable ?x) (handempty ))
     :effect (and
        (holding ?x)
        (not (ontable ?x))
        (not (clear ?x))
        (not (handempty )))
    )


    (:action put-down
     :parameters (?x - block)
     :precondition (holding ?x)
     :effect (and
        (clear ?x)
        (handempty )
        (ontable ?x)
        (not (holding ?x)))
    )


    (:action stack
     :parameters (?x - block ?y - block)
     :precondition (holding ?x)
     :effect (and
        (clear ?x)
        (handempty )
        (on ?x ?y)
        (not (holding ?x))
        (not (clear ?y)))
    )


    (:action unstack
     :parameters (?x - block ?y - block)
     :precondition (clear ?x)
     :effect (and
        (holding ?x)
        (clear ?y)
        (not (clear ?x))
        (not (handempty ))
        (not (on ?x ?y)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        a b c d e - block
    )

    (:init
        (clear d)
        (clear c)
        (ontable d)
        (ontable a)
        (on b a)
        (on c e)
        (on e b)
        (handempty )
    )

    (:goal
        (and (on e b) (on b d) (on a e))
    )

    
    
    
)

; plan
1. (unstack d a)
   deleted: (clear d) (handempty)
   added: (holding d) (clear a)
   goals met: 1 of 3
2. (stack d c)
   deleted: (holding d) (clear c)
   added: (clear d) (handempty) (on d c)
   goals met: 1 of 3
3. (unstack a b)
   deleted: (clear a) (handempty)
   added: (holding a) (clear b)
   goals met: 1 of 3
4. (stack a e)
   deleted: (holding a)
   added: (clear a) (handempty) (on a e)
   goals met: 2 of 3
5. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b)
   goals met: 2 of 3
6. (stack b d)
   deleted: (holding b) (clear d)
   added: (clear b) (handempty) (on b d)
   goals met: 3 of 3
